Tekla Open API Reference for Tekla Structures 2025
PourObject.Attributes Property
 The attributes of the pour. For more information see PourObject.PourAttributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PourObject.PourAttributes Attributes { get; set; }
Public Property Attributes As PourObject.PourAttributes
	Get
	Set
Property Value
Type: PourObject.PourAttributes
See Also
Reference
PourObject Class
Tekla.Structures.Drawing Namespace